Repository: CofficLab/GitOK
Catalog: Packages/PluginCommitDetail/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Author, committer, timestamps, and full message at a glance.
zh_hans: 作者、提交者、时间戳与完整消息一览无余。
zh_hk: 作者、提交者、時間戳與完整消息一覽無餘。

source: Browse files, hunks, and metadata in the detail pane.
zh_hans: 在详情面板中浏览文件、代码块与元信息。
zh_hk: 在詳情面板中瀏覽文件、代碼塊與元信息。

source: click from list
zh_hans: 从列表点击
zh_hk: 從列表點擊

source: Complete Diff
zh_hans: 完整差异
zh_hk: 完整差異

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: diff
zh_hans: 差异
zh_hk: 差異

source: Diff
zh_hans: 差异
zh_hk: 差異

source: Every commit, explained down to the last line.
zh_hans: 每个提交，解释到最后一行的细节。
zh_hk: 每個提交，解釋到最後一行的細節。

source: File Navigator
zh_hans: 文件导航
zh_hk: 文件導航

source: Files
zh_hans: 文件
zh_hk: 文件

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Inspect
zh_hans: 检查
zh_hk: 檢查

source: Jump between changed files in the commit instantly.
zh_hans: 在提交涉及的文件之间即时跳转。
zh_hk: 在提交涉及的文件之間即時跳轉。

source: Load the diff
zh_hans: 加载差异
zh_hk: 加載差異

source: Metadata
zh_hans: 元信息
zh_hk: 元信息

source: Pick a commit
zh_hans: 选择提交
zh_hk: 選擇提交

source: Rich Metadata
zh_hans: 丰富元信息
zh_hk: 豐富元信息

source: See every file change with precise additions and deletions.
zh_hans: 查看每个文件的精确增删变化。
zh_hk: 查看每個文件的精確增刪變化。

source: Select any row in the commit list.
zh_hans: 在提交列表中任选一行。
zh_hk: 在提交列表中任選一行。

source: The commit's parents are diffed to build the change set.
zh_hans: 与父提交做差异，构建变更集。
zh_hk: 與父提交做差異，構建變更集。

source: Cancel
zh_hans: 取消

source: Changes
zh_hans: 更改

source: Clear Selection
zh_hans: 清除选择

source: Confirm Discard
zh_hans: 确认丢弃

source: Confirm Discard All
zh_hans: 确认放弃全部修改

source: Discard
zh_hans: 丢弃

source: Discard all %lld changes, including staged, unstaged, and untracked files? This cannot be undone.
zh_hans: 确定要放弃全部 %lld 项修改吗？包括已暂存、未暂存和未跟踪文件，此操作不可撤销。

source: Discard All Changes
zh_hans: 放弃所有修改

source: Discard changes for %@? This cannot be undone.
zh_hans: 确定要丢弃文件 %@ 的更改吗？此操作不可撤销。

source: Discard changes for %lld selected files? This cannot be undone.
zh_hans: 确定要丢弃已选择的 %lld 个文件的更改吗？此操作不可撤销。

source: Discarding all changes...
zh_hans: 正在丢弃所有修改…

source: Discarding...
zh_hans: 正在丢弃…

source: Loading changed files...
zh_hans: 正在加载变更文件…

source: Loading more files...
zh_hans: 正在加载更多文件…

source: Loading workspace changes...
zh_hans: 正在加载工作区变更…

source: No Changes
zh_hans: 无更改

source: Not Staged
zh_hans: 未暂存

source: Preparing changes...
zh_hans: 正在准备修改…

source: Select All Current
zh_hans: 全选当前

source: Select File
zh_hans: 选择文件

source: Selected
zh_hans: 已选择

source: Stage
zh_hans: 暂存

source: Staged
zh_hans: 已暂存

source: Staged + Modified
zh_hans: 已暂存 + 已修改

source: Staging...
zh_hans: 正在暂存…

source: This commit has no file changes.
zh_hans: 此提交没有文件更改。

source: Unable to Load Changes
zh_hans: 无法加载更改

source: Unstage
zh_hans: 取消暂存

source: Unstaging...
zh_hans: 正在取消暂存…

source: Untracked
zh_hans: 未跟踪
